In [1]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt 
import seaborn as sns

In [2]:
transaction = pd.read_csv('transactions.csv')
transaction.head()

         date  store_nbr  transactions
0  2013-01-01         25           770
1  2013-01-02          1          2111
2  2013-01-02          2          2358
3  2013-01-02          3          3487
4  2013-01-02          4          1922

In [3]:
transaction.tail()

             date  store_nbr  transactions
83483  2017-08-15         50          2804
83484  2017-08-15         51          1573
83485  2017-08-15         52          2255
83486  2017-08-15         53           932
83487  2017-08-15         54           802

In [4]:
transaction.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          83488 non-null  object
 1   store_nbr     83488 non-null  int64
 2   transactions  83488 non-null  int64
dtypes: int64(2), object(1)
memory usage: 1.9+ MB

In [5]:
transaction['date'] = pd.to_datetime(transaction['date'], format= '%Y-%m-%d')
transaction.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 83488 entries, 0 to 83487
Data columns (total 3 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   date          83488 non-null  datetime64[ns]
 1   store_nbr     83488 non-null  int64
 2   transactions  83488 non-null  int64
dtypes: datetime64[ns](1), int64(2)
memory usage: 1.9 MB

In [6]:
store = pd.read_csv('stores.csv')
store.head()

   store_nbr           city                           state type  cluster
0          1          Quito                       Pichincha    D       13
1          2          Quito                       Pichincha    D       13
2          3          Quito                       Pichincha    D        8
3          4          Quito                       Pichincha    D        9
4          5  Santo Domingo  Santo Domingo de los Tsachilas    D        4

In [7]:
store.head()

   store_nbr           city                           state type  cluster
0          1          Quito                       Pichincha    D       13
1          2          Quito                       Pichincha    D       13
2          3          Quito                       Pichincha    D        8
3          4          Quito                       Pichincha    D        9
4          5  Santo Domingo  Santo Domingo de los Tsachilas    D        4

cluster means grouping of similar stores
what is type?

In [8]:
store.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54 entries, 0 to 53
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   store_nbr  54 non-null     int64
 1   city       54 non-null     object
 2   state      54 non-null     object
 3   type       54 non-null     object
 4   cluster    54 non-null     int64
dtypes: int64(2), object(3)
memory usage: 2.2+ KB

In [9]:
# most common type of store

store['type'].value_counts()

type
D    18
C    15
A     9
B     8
E     4
Name: count, dtype: int64

In [10]:
# which city has the most stores

store['city'].value_counts()

city
Quito            18
Guayaquil         8
Cuenca            3
Santo Domingo     3
Latacunga         2
Machala           2
Manta             2
Ambato            2
Cayambe           1
Riobamba          1
Ibarra            1
Salinas           1
Puyo              1
Guaranda          1
Quevedo           1
Babahoyo          1
Daule             1
Playas            1
Loja              1
Libertad          1
Esmeraldas        1
El Carmen         1
Name: count, dtype: int64

In [11]:
# Which state has the most stores

store['state'].value_counts()

state
Pichincha                         19
Guayas                            11
Azuay                              3
Santo Domingo de los Tsachilas     3
Manabi                             3
Los Rios                           2
Cotopaxi                           2
Tungurahua                         2
El Oro                             2
Bolivar                            1
Imbabura                           1
Chimborazo                         1
Pastaza                            1
Santa Elena                        1
Loja                               1
Esmeraldas                         1
Name: count, dtype: int64

In [12]:
holiday = pd.read_csv('holidays_events.csv')
holiday.head()

,date,type,locale,locale_name,description,transferred
0,2012-03-02,Holiday,Local,Manta,Fundacion de Manta,False
1,2012-04-01,Holiday,Regional,Cotopaxi,Provincializacion de Cotopaxi,False
2,2012-04-12,Holiday,Local,Cuenca,Fundacion de Cuenca,False
3,2012-04-14,Holiday,Local,Libertad,Cantonizacion de Libertad,False
4,2012-04-21,Holiday,Local,Riobamba,Cantonizacion de Riobamba,False

A holiday that is transferred officially falls on that calendar day, but was moved to another date by the government. A transferred day is more like a normal day than a holiday. To find the day that it was actually celebrated, look for the corresponding row where type is Transfer. For example, the holiday Independencia de Guayaquil was transferred from 2012-10-09 to 2012-10-12, which means it was celebrated on 2012-10-12. Days that are type Bridge are extra days that are added to a holiday (e.g., to extend the break across a long weekend). These are frequently made up by the type Work Day which is a day not normally scheduled for work (e.g., Saturday) that is meant to payback the Bridge.
Additional holidays are days added a regular calendar holiday, for example, as typically happens around Christmas (making Christmas Eve a holiday).

Holidays and events data is a meta data. This data is quite valuable to understand past sales, trend and seasonality components. However, it needs to be arranged. You are going to find a comprehensive data manipulation for this data. That part will be one of the most important chapter in this notebook.

In [13]:
holiday.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 350 entries, 0 to 349
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         350 non-null    object
 1   type         350 non-null    object
 2   locale       350 non-null    object
 3   locale_name  350 non-null    object
 4   description  350 non-null    object
 5   transferred  350 non-null    bool
dtypes: bool(1), object(5)
memory usage: 14.1+ KB

In [14]:
holiday['date'] = pd.to_datetime(holiday['date'], format= '%Y-%m-%d')
holiday.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 350 entries, 0 to 349
Data columns (total 6 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   date         350 non-null    datetime64[ns]
 1   type         350 non-null    object
 2   locale       350 non-null    object
 3   locale_name  350 non-null    object
 4   description  350 non-null    object
 5   transferred  350 non-null    bool
dtypes: bool(1), datetime64[ns](1), object(4)
memory usage: 14.1+ KB

In [15]:
holiday['type'].value_counts()

type
Holiday       221
Event          56
Additional     51
Transfer       12
Bridge          5
Work Day        5
Name: count, dtype: int64

## Maybe i will the drop the rows where category of products made zero sales

In [16]:
main_df = pd.read_csv('train.csv', index_col='id')
main_df.head()

          date  store_nbr      family  sales  onpromotion
id
0   2013-01-01          1  AUTOMOTIVE    0.0            0
1   2013-01-01          1   BABY CARE    0.0            0
2   2013-01-01          1      BEAUTY    0.0            0
3   2013-01-01          1   BEVERAGES    0.0            0
4   2013-01-01          1       BOOKS    0.0            0

* The training data, comprising time series of features store_nbr, family, and onpromotion as well as the target sales.
* store_nbr identifies the store at which the products are sold.
* family identifies the type of product sold.
* sales gives the total sales for a product family at a particular store at a given date. Fractional values are possible since products can be sold in fractional units (1.5 kg of cheese, for instance, as opposed to 1 bag of chips).
* onpromotion gives the total number of items in a product family that were being promoted at a store at a given date.

In [17]:
main_df.head()

          date  store_nbr      family  sales  onpromotion
id
0   2013-01-01          1  AUTOMOTIVE    0.0            0
1   2013-01-01          1   BABY CARE    0.0            0
2   2013-01-01          1      BEAUTY    0.0            0
3   2013-01-01          1   BEVERAGES    0.0            0
4   2013-01-01          1       BOOKS    0.0            0

In [18]:
main_df.tail()

,date,store_nbr,family,sales,onpromotion
id,,,,,
3000883,2017-08-15,9,POULTRY,438.133,0
3000884,2017-08-15,9,PREPARED FOODS,154.553,1
3000885,2017-08-15,9,PRODUCE,2419.729,148
3000886,2017-08-15,9,SCHOOL AND OFFICE SUPPLIES,121.000,8
3000887,2017-08-15,9,SEAFOOD,16.000,0

In [19]:
main_df['family'].value_counts()

family
AUTOMOTIVE                    90936
BABY CARE                     90936
BEAUTY                        90936
BEVERAGES                     90936
BOOKS                         90936
BREAD/BAKERY                  90936
CELEBRATION                   90936
CLEANING                      90936
DAIRY                         90936
DELI                          90936
EGGS                          90936
FROZEN FOODS                  90936
GROCERY I                     90936
GROCERY II                    90936
HARDWARE                      90936
HOME AND KITCHEN I            90936
HOME AND KITCHEN II           90936
HOME APPLIANCES               90936
HOME CARE                     90936
LADIESWEAR                    90936
LAWN AND GARDEN               90936
LINGERIE                      90936
LIQUOR,WINE,BEER              90936
MAGAZINES                     90936
MEATS                         90936
PERSONAL CARE                 90936
PET SUPPLIES                  90936
PLAYERS AND ELECTRONICS       90936
POULTRY                       90936
PREPARED FOODS                90936
PRODUCE                       90936
SCHOOL AND OFFICE SUPPLIES    90936
SEAFOOD                       90936
Name: count, dtype: int64

In [29]:
# check how many of them have sales as 0

# zero = main_df.groupby(['store_nbr', 'family']).sales.sum().reset_index().sort_values(['family', 'store_nbr'])

# zero = zero[zero.sales == 0]
# zero

zero_sales = main_df[main_df['sales'] == 0]
zero_sales.head(50)

          date  store_nbr                      family  sales  onpromotion
id
0   2013-01-01          1                  AUTOMOTIVE    0.0            0
1   2013-01-01          1                   BABY CARE    0.0            0
2   2013-01-01          1                      BEAUTY    0.0            0
3   2013-01-01          1                   BEVERAGES    0.0            0
4   2013-01-01          1                       BOOKS    0.0            0
5   2013-01-01          1                BREAD/BAKERY    0.0            0
6   2013-01-01          1                 CELEBRATION    0.0            0
7   2013-01-01          1                    CLEANING    0.0            0
8   2013-01-01          1                       DAIRY    0.0            0
9   2013-01-01          1                        DELI    0.0            0
10  2013-01-01          1                        EGGS    0.0            0
11  2013-01-01          1                FROZEN FOODS    0.0            0
12  2013-01-01          1                   GROCERY I    0.0            0
13  2013-01-01          1                  GROCERY II    0.0            0
14  2013-01-01          1                    HARDWARE    0.0            0
15  2013-01-01          1          HOME AND KITCHEN I    0.0            0
16  2013-01-01          1         HOME AND KITCHEN II    0.0            0
17  2013-01-01          1             HOME APPLIANCES    0.0            0
18  2013-01-01          1                   HOME CARE    0.0            0
19  2013-01-01          1                  LADIESWEAR    0.0            0
20  2013-01-01          1             LAWN AND GARDEN    0.0            0
21  2013-01-01          1                    LINGERIE    0.0            0
22  2013-01-01          1            LIQUOR,WINE,BEER    0.0            0
23  2013-01-01          1                   MAGAZINES    0.0            0
24  2013-01-01          1                       MEATS    0.0            0
25  2013-01-01          1               PERSONAL CARE    0.0            0
26  2013-01-01          1                PET SUPPLIES    0.0            0
27  2013-01-01          1     PLAYERS AND ELECTRONICS    0.0            0
28  2013-01-01          1                     POULTRY    0.0            0
29  2013-01-01          1              PREPARED FOODS    0.0            0
30  2013-01-01          1                     PRODUCE    0.0            0
31  2013-01-01          1  SCHOOL AND OFFICE SUPPLIES    0.0            0
32  2013-01-01          1                     SEAFOOD    0.0            0
33  2013-01-01         10                  AUTOMOTIVE    0.0            0
34  2013-01-01         10                   BABY CARE    0.0            0
35  2013-01-01         10                      BEAUTY    0.0            0
36  2013-01-01         10                   BEVERAGES    0.0            0
37  2013-01-01         10                       BOOKS    0.0            0
38  2013-01-01         10                BREAD/BAKERY    0.0            0
39  2013-01-01         10                 CELEBRATION    0.0            0
40  2013-01-01         10                    CLEANING    0.0            0
41  2013-01-01         10                       DAIRY    0.0            0
42  2013-01-01         10                        DELI    0.0            0
43  2013-01-01         10                        EGGS    0.0            0
44  2013-01-01         10                FROZEN FOODS    0.0            0
45  2013-01-01         10                   GROCERY I    0.0            0
46  2013-01-01         10                  GROCERY II    0.0            0
47  2013-01-01         10                    HARDWARE    0.0            0
48  2013-01-01         10          HOME AND KITCHEN I    0.0            0
49  2013-01-01         10         HOME AND KITCHEN II    0.0            0

In [30]:
zero_sales.tail(50)

               date  store_nbr                      family  sales  onpromotion
id
3000476  2017-08-15         47             HOME APPLIANCES    0.0            0
3000493  2017-08-15         48                   BABY CARE    0.0            0
3000496  2017-08-15         48                       BOOKS    0.0            0
3000506  2017-08-15         48                    HARDWARE    0.0            0
3000509  2017-08-15         48             HOME APPLIANCES    0.0            0
3000513  2017-08-15         48                    LINGERIE    0.0            0
3000526  2017-08-15         49                   BABY CARE    0.0            0
3000529  2017-08-15         49                       BOOKS    0.0            0
3000542  2017-08-15         49             HOME APPLIANCES    0.0            0
3000559  2017-08-15          5                   BABY CARE    0.0            0
3000562  2017-08-15          5                       BOOKS    0.0            0
3000572  2017-08-15          5                    HARDWARE    0.0            0
3000575  2017-08-15          5             HOME APPLIANCES    0.0            0
3000589  2017-08-15          5  SCHOOL AND OFFICE SUPPLIES    0.0            0
3000592  2017-08-15         50                   BABY CARE    0.0            0
3000595  2017-08-15         50                       BOOKS    0.0            0
3000608  2017-08-15         50             HOME APPLIANCES    0.0            0
3000625  2017-08-15         51                   BABY CARE    0.0            0
3000628  2017-08-15         51                       BOOKS    0.0            0
3000641  2017-08-15         51             HOME APPLIANCES    0.0            0
3000655  2017-08-15         51  SCHOOL AND OFFICE SUPPLIES    0.0            0
3000658  2017-08-15         52                   BABY CARE    0.0            0
3000661  2017-08-15         52                       BOOKS    0.0            0
3000674  2017-08-15         52             HOME APPLIANCES    0.0            0
3000691  2017-08-15         53                   BABY CARE    0.0            0
3000694  2017-08-15         53                       BOOKS    0.0            0
3000707  2017-08-15         53             HOME APPLIANCES    0.0            0
3000721  2017-08-15         53  SCHOOL AND OFFICE SUPPLIES    0.0            0
3000724  2017-08-15         54                   BABY CARE    0.0            0
3000725  2017-08-15         54                      BEAUTY    0.0            0
3000727  2017-08-15         54                       BOOKS    0.0            0
3000737  2017-08-15         54                    HARDWARE    0.0            0
3000740  2017-08-15         54             HOME APPLIANCES    0.0            0
3000742  2017-08-15         54                  LADIESWEAR    0.0            0
3000743  2017-08-15         54             LAWN AND GARDEN    0.0            0
3000749  2017-08-15         54                PET SUPPLIES    0.0            0
3000754  2017-08-15         54  SCHOOL AND OFFICE SUPPLIES    0.0            0
3000757  2017-08-15          6                   BABY CARE    0.0            0
3000760  2017-08-15          6                       BOOKS    0.0            0
3000773  2017-08-15          6             HOME APPLIANCES    0.0            0
3000787  2017-08-15          6  SCHOOL AND OFFICE SUPPLIES    0.0            0
3000790  2017-08-15          7                   BABY CARE    0.0            0
3000793  2017-08-15          7                       BOOKS    0.0            0
3000826  2017-08-15          8                       BOOKS    0.0            0
3000836  2017-08-15          8                    HARDWARE    0.0            0
3000839  2017-08-15          8             HOME APPLIANCES    0.0            0
3000853  2017-08-15          8  SCHOOL AND OFFICE SUPPLIES    0.0            0
3000856  2017-08-15          9                   BABY CARE    0.0            0
3000859  2017-08-15          9                       BOOKS    0.0            0
3000872  2017-08-15          9             HOME APPLIANCES    0.0            0

There are almost a million rows where sales is zero. This means on that particular day in a particular store 0 sales were made in from that particular category.

In [25]:
zero_sales.shape, main_df.shape

((939130, 5), (3000888, 5))

In [26]:
3000888 - 939130

2061758

In [32]:
# when onpromotion is != 0

promo_sales = main_df[main_df['onpromotion'] != 0]
promo_sales.head(50)

              date  store_nbr          family       sales  onpromotion
id
810784  2014-04-01          9        CLEANING  1752.00000            3
810789  2014-04-01          9       GROCERY I  7685.00000            5
812571  2014-04-02          9       GROCERY I  6481.00000            3
812587  2014-04-02          9         POULTRY   613.71704            1
814346  2014-04-03          9    BREAD/BAKERY   521.00000            1
814350  2014-04-03          9            DELI   602.93470           56
814351  2014-04-03          9            EGGS   136.00000           20
814353  2014-04-03          9       GROCERY I  6166.00000            1
814365  2014-04-03          9           MEATS   404.38310           19
814369  2014-04-03          9         POULTRY   685.42190           20
814373  2014-04-03          9         SEAFOOD    22.92740            3
816130  2014-04-04          9        CLEANING  1300.00000            3
816134  2014-04-04          9    FROZEN FOODS    61.49500            1
816135  2014-04-04          9       GROCERY I  4697.00000            1
817908  2014-04-05          9       BEVERAGES  2217.00000            2
817910  2014-04-05          9    BREAD/BAKERY   577.00000            1
817912  2014-04-05          9        CLEANING  2379.00000            1
817917  2014-04-05          9       GROCERY I  8930.90500            1
817933  2014-04-05          9         POULTRY   840.57000            2
819694  2014-04-06          9        CLEANING  2503.00000            2
819699  2014-04-06          9       GROCERY I  9917.45200            5
821474  2014-04-07          9    BREAD/BAKERY   597.00000            1
821481  2014-04-07          9       GROCERY I  6045.88100            2
823254  2014-04-08          9       BEVERAGES  1237.00000            1
823256  2014-04-08          9    BREAD/BAKERY   565.00000            2
823258  2014-04-08          9        CLEANING  1086.00000            2
823263  2014-04-08          9       GROCERY I  4386.57100            3
825040  2014-04-09          9        CLEANING  1324.00000            3
825043  2014-04-09          9            EGGS   109.00000            1
826818  2014-04-10          9       BEVERAGES   991.00000            1
826820  2014-04-10          9    BREAD/BAKERY   418.00000            1
826822  2014-04-10          9        CLEANING  1048.00000            1
826823  2014-04-10          9           DAIRY   584.00000            4
826824  2014-04-10          9            DELI   488.56540           56
826825  2014-04-10          9            EGGS   199.00000           18
826839  2014-04-10          9           MEATS   354.48300           18
826843  2014-04-10          9         POULTRY   567.84120           17
826844  2014-04-10          9  PREPARED FOODS    56.86000            1
826847  2014-04-10          9         SEAFOOD     9.61710            2
828605  2014-04-11          9           DAIRY   531.00000            1
828608  2014-04-11          9    FROZEN FOODS    69.07500            1
828609  2014-04-11          9       GROCERY I  3728.64300           12
830382  2014-04-12          9       BEVERAGES  1604.00000            1
830386  2014-04-12          9        CLEANING  1575.00000            1
830388  2014-04-12          9            DELI   560.51400            1
830390  2014-04-12          9    FROZEN FOODS    61.00000            1
830391  2014-04-12          9       GROCERY I  5979.54800            6
832168  2014-04-13          9        CLEANING  1783.00000            1
832169  2014-04-13          9           DAIRY  1057.00000            5
832170  2014-04-13          9            DELI   634.54100            4

In [33]:
main_df.head(1)

          date  store_nbr      family  sales  onpromotion
id
0   2013-01-01          1  AUTOMOTIVE    0.0            0

In [35]:
holiday.head(1)

        date     type locale locale_name         description  transferred
0 2012-03-02  Holiday  Local       Manta  Fundacion de Manta        False

In [34]:
store.head(1)

   store_nbr   city      state type  cluster
0          1  Quito  Pichincha    D       13

In [37]:
transaction.head(1)

        date  store_nbr  transactions
0 2013-01-01         25           770